=== ВАРИАНТ 3: Ветвления ===
Принадлежность точки (x,y) заштрихованной области
0 0 для выхода

Введите x, y: -2 1
Точка ( -2.00,   1.00):
  X: отрицательный ([-5..5])
  Y: положительный ([-8..3])
  Область: ✓ В ОБЛАСТИ

Введите x, y: 2 1
Точка (  2.00,   1.00):
  X: положительный ([-5..5])
  Y: положительный ([-8..3])
  Область: ✓ В ОБЛАСТИ

Введите x, y: 0 3.5
Точка (  0.00,   3.50):
  X: ноль ([-5..5])
  Y: положительный (вне [-8..3])
  Область: ✗ ВНЕ ОБЛАСТИ

Введите x, y: 0 0

Программа выполнена!
